// تعریف یک شیء ثابت برای پیام‌های مربوط به پست‌ها
const PostMessages = Object.freeze({
  // پیام موفقیت‌آمیز در هنگام ایجاد آگهی
  Created: "!آگهی با کوفقیت ایجاد شد",

  // پیام موفقیت‌آمیز در هنگام حذف آگهی
  Deleted: "!آگهی با موفقیت حذف شد",

  // پیام در صورتی که آگهی مورد نظر یافت نشود
  NotFound: "!آگهی یافت نشد",

  // پیام در صورتی که آگهی تکراری باشد و اجازه ایجاد داده نشود
  AlreadyExist: "!آگهی تکراری می‌باشد",

  // پیام در صورتی که درخواست ارسالی معتبر نباشد
  RequestNotValid: "!درخواست شما صحیح نمی‌باشد",
});

// صادر کردن شیء پیام‌ها برای استفاده در سایر بخش‌های برنامه
module.exports = {
  PostMessages,
};
