// تعریف یک شیء ثابت با استفاده از Object.freeze
// این شیء شامل نام‌های کوکی‌هایی است که در اپلیکیشن استفاده خواهند شد.
// استفاده از Object.freeze به این معناست که مقادیر درون شیء قابل تغییر نخواهند بود.
// این کار برای جلوگیری از تغییرات ناخواسته یا خطاهای احتمالی انجام می‌شود.
const CookieNames = Object.freeze({
  // نام کوکی برای توکن دسترسی (Access Token) که معمولاً برای شناسایی کاربر و تایید هویت او
  // در هر درخواست استفاده می‌شود. این کوکی می‌تواند شامل JWT یا سایر توکن‌های مشابه باشد.
  AccessToken: "access_token",

  // نام کوکی برای محیط توسعه (Development) که می‌تواند برای شناسایی وضعیت محیطی (مثل
  // توسعه، تولید، یا تست) استفاده شود. این کوکی به‌ویژه برای مدیریت ویژگی‌ها یا تنظیمات خاص
  // در هنگام توسعه کاربرد دارد.
  Develpment: "development",
});

// صادر کردن شیء CookieNames برای استفاده در سایر بخش‌های اپلیکیشن.
// این روش به شما اجازه می‌دهد تا در بخش‌های مختلف اپلیکیشن از نام‌های ثابت کوکی استفاده کنید
// و از بروز خطاهای تایپی جلوگیری کنید.
module.exports = CookieNames;
